[FunctionHelp]
$casenum9=9@$Casenum@$CASENUM@現在のケースの時系列番号。各ケースの $CASENUM は、読み取られるケースの最大数 (そのケースを含む) です。書式 F8.0 です。行番号は [データ エディタ] ウィンドウ (ウィンドウの環境で利用可能) にあるので、$CASENUM の値は必須ではありません。またファイルが並び替えられたり、新しいケースがファイルの終わりの前に挿入されると値は変化します。
$sysmis10=10@$Sysmis@$SYSMIS@システム欠損値。システム欠損値は、ピリオド (.) として表示されるか、小数点として使用されます。
$date4=4@$Date@$DATE@2 桁の年数をとる国際的な日付書式での現在の日付。この書式は、dd-mmm-yy 形式の A9 です。
$jdate4=4@$JDate@$JDATE@1582 年 10 月 14 日 (太陽暦の 1 日目) から現在の日付までの日数。書式 F6.0 です。
$date114=4@$Date11@$DATE11@4 桁の年数をとる国際的な日付書式での現在の日付。この書式は、dd-mmm-yyyy 形式の A11 です。
$time4=4@$Time@$TIME@現在の日付と時刻。このシステム変数では、システム変数を使用する変換コマンドが実行される日時が、1582 年 10 月 14 日からの通算秒数で表されます。書式 F20 です。各種書式の日付の書式としてこれを表示できます。日付と時刻機能を使用することもできます。
abs1=1@Abs@ABS(?)@ABS(numexpr)。数値型。numexpr の絶対値を返します。numexpr は数値である必要があります。
any13=13@Any@ANY(?,?)@ANY(test,value[,value,...])。論理型。test の値がその後の value のどれかに一致する場合、1 または真を戻し、それ以外では 0 または偽を戻します。この関数には 2 つ以上の引数が必要です。たとえば、ANY(var1, 1, 3, 5) は、var1 の値が 1、3、または 5 の場合に 1 を返し、その他の値については 0 を返します。ANY は、値の変数または式のリストをスキャンする場合にも使用できます。たとえば、ANY(1, var1, var2, var3) は、指定された 3 つの変数のいずれかに値 1 がある場合に 1 を返し、3 つの変数すべてが 1 以外の値である場合に 0 を返します。
applymodel19=19@Applymodel@ApplyModel(?,?,?)@ApplyModel(handle, "function", value)。数値型。 handle で指定されたモデルを使用して、特定のスコア関数を入力ケースデータに適用します。"function" は、引用符で囲まれた文字列リテラル値で、次のうちのいずれかを指定します。 predict、stddev、probability、confidence、nodeid、cumhazard、neighbor、distance。モデル ハンドルは、MODEL HANDLE コマンドで定義した外部の XML ファイルに関連付けられた名前です。オプションの 3 番目の引数は、関数が「確率」、「近隣」、または「距離」の場合に適用されます。「確率」の場合、確率が計算されるカテゴリを指定します。「近隣」および「距離」の場合、最近隣モデルの特定の近隣を整数で指定します。値を計算することができない場合、ApplyModel ではシステム欠損値が返されます。
arsin1=1@Arsin@ARSIN(?)@ARSIN(numexpr)。数値型。ラジアンでの、numexpr のサインの逆関数を返します。これは、-1 から +1 までの間の数値である必要があります。
artan1=1@Artan@ARTAN(?)@ARTAN(numexpr)。数値型。ラジアンでの、numexpr のタンジェントの逆関数を返します。これは数値である必要があります。
cdf.bernoulli2=2@Cdf.Bernoulli@CDF.BERNOULLI(?,?)@CDF.BERNOULLI(quant, prob)。数値型。指定の確率パラメータを持つベルヌーイ分布から取り出された値が quant 以下になる累積確率を返します。
cdf.beta2=2@Cdf.Beta@CDF.BETA(?,?,?)@CDF.BETA(quant, shape1, shape2)。数値型。指定の shape パラメータを持つベータ分布から取り出された値が quant 未満になる累積確率を返します。
cdf.binom2=2@Cdf.Binom@CDF.BINOM(?,?,?)@CDF.BINOM(quant, n, prob)。数値型。毎回の成功の確率が prob である分布で、n 回試行して成功した回数が quant 以下になる累積確率を返します。n が 1 回であれば CDF.BERNOULLI と同じ値になります。
cdf.bvnor2=2@Cdf.Bvnor@CDF.BVNOR(?)@CDF.BVNOR(quant1, quant2, corr)。数値型。指定の correlation パラメータを持つ 2 変量の標準正規分布から取り出された値が quant1 および quant2 未満になる累積確率を返します。
cdf.cauchy2=2@Cdf.Cauchy@CDF.CAUCHY(?,?,?)@CDF.CAUCHY(quant, loc, scale)。数値型。指定の location および scale パラメータを持つコーシー分布から取り出された値が quant 未満になる累積確率を返します。
cdf.chisq2=2@Cdf.Chisq@CDF.CHISQ(?,?)@CDF.CHISQ(quant, df)。数値型。自由度 df を持つカイ 2 乗分布から取り出された値が quant 未満になる累積確率を返します。
cdf.exp2=2@Cdf.Exp@CDF.EXP(?,?)@CDF.EXP(quant, scale)。数値型。指定の shape パラメータを持つ指数分布から取り出された値が quant 未満になる累積確率を返します。
cdf.f2=2@Cdf.F@CDF.F(?,?,?)@CDF.F(quant, df1, df2)。数値型。自由度 df1 および df2 を持つ F 分布から取り出された値が quant 未満になる累積確率を返します。
cdf.gamma2=2@Cdf.Gamma@CDF.GAMMA(?,?,?)@CDF.GAMMA(quant, shape, scale)。数値型。指定の shape および scale パラメータを持つガンマ分布から取り出された値が quant 未満になる累積確率を返します。
cdf.geom2=2@Cdf.Geom@CDF.GEOM(?,?)@CDF.GEOM(quant, prob)。数値型。成功の確率が prob である分布で、1 回の成功を得るために必要な試行の回数が quant 以下になる累積確率を返します。
cdf.halfnrm2=2@Cdf.Halfnrm@CDF.HALFNRM(?)@CDF.HALFNRM(quant, mean, stddev)。数値型。指定の mean および標準偏差 stddev を持つ半正規分布から取り出された値が quant 未満になる累積確率を返します。
cdf.hyper2=2@Cdf.Hyper@CDF.HYPER(?,?,?,?)@CDF.HYPER(quant, total, sample, hits)。数値型。大きさが total の母集団から sample 個のオブジェクトを無作為に抽出したときに、指定された文字 hits を含むオブジェクトの個数の値が quant 以下になる累積確率を返します。
cdf.igauss2=2@Cdf.Igauss@CDF.IGAUSS(?,?,?)@CDF.IGAUSS(quant, loc, scale)。数値型。指定の location および scale パラメータを持つ逆ガウス分布から取り出された値が quant 未満になる累積確率を返します。
cdf.laplace2=2@Cdf.Laplace@CDF.LAPLACE(?,?,?)@CDF.LAPLACE(quant, mean, scale)。数値型。指定の mean および scale パラメータを持つラプラス分布から取り出された値が quant 未満になる累積確率を返します。
cdf.lnormal2=2@Cdf.Lnormal@CDF.LNORMAL(?,?,?)@CDF.LNORMAL(quant, a, b)。数値型。指定のパラメータを持つ対数正規分布から取り出された値が quant 未満になる累積確率を返します。
cdf.logistic2=2@Cdf.Logistic@CDF.LOGISTIC(?,?,?)@CDF.LOGISTIC(quant, mean, scale)。数値型。指定の mean および scale パラメータを持つロジスティック分布から取り出された値が quant 未満になる累積確率を返します。
cdf.negbin2=2@Cdf.Negbin@CDF.NEGBIN(?,?,?)@CDF.NEGBIN(quant, thresh, prob)。数値型。閾値パラメータが thresh であり、成功の確率が prob である時に、1 回の成功を得るために必要な試行の回数が quant 以下になる累積確率を返します。
cdf.normal2=2@Cdf.Normal@CDF.NORMAL(?,?,?)@CDF.NORMAL(quant, mean, stddev)。数値型。指定の mean および標準偏差 stddev を持つ正規分布から取り出された値が quant 未満になる累積確率を返します。
cdf.pareto2=2@Cdf.Pareto@CDF.PARETO(?,?,?)@CDF.PARETO(quant, threshold, shape)。数値型。指定の threshold および shape パラメータを持つパレート分布から取り出された値が quant 未満になる累積確率を返します。
cdf.poisson2=2@Cdf.Poisson@CDF.POISSON(?,?)@CDF.POISSON(quant, mean)。数値型。指定の mean または比率パラメータを持つポアソン分布から取り出された値が quant 以下になる累積確率を返します。
cdf.smod2=2@Cdf.Smod@CDF.SMOD(?)@CDF.SMOD(quant, a, b)。数値型。指定のパラメータを持つスチューデント化された最大法から取り出された値が quant 未満になる累積確率を返します。
cdf.srange2=2@Cdf.Srange@CDF.SRANGE(?)@CDF.SRANGE(quant, a, b)。数値型。指定のパラメータを持つスチューデント化された範囲統計量から取り出された値が quant 未満になる累積確率を返します。
cdf.t2=2@Cdf.T@CDF.T(?,?)@CDF.T(quant, df)。数値型。指定の自由度 df を持つスチューデント t 分布から取り出された値が quant 未満になる累積確率を返します。
cdf.uniform2=2@Cdf.Uniform@CDF.UNIFORM(?,?,?)@CDF.UNIFORM(quant, min, max)。数値型。指定の minimum と maximum を持つ一様分布から取り出された値が quant 未満になる累積確率を返します。
cdf.weibull2=2@Cdf.Weibull@CDF.WEIBULL(?,?,?)@CDF.WEIBULL(quant, a, b)。数値型。指定のパラメータを持つワイブル分布から取り出された値が quant 未満になる累積確率を返します。
cdfnorm2=2@Cdfnorm@CDFNORM(?)@CDFNORM(zvalue)。数値型。平均値が 0 で標準偏差が 1 の乱数変数が zvalue 未満になる確率を返します。zvalue は数値である必要があります。
cfvar15=15@Cfvar@CFVAR(?,?)@CFVAR(numexpr,numexpr[,...])。数値型。有効な値を持つ引数の変動係数 (標準偏差を平均値で割った値) を返します。この関数には、2 つ以上の引数が必要です。この引数は、数値である必要があります。この関数が取る有効な引数の最小数を指定できます。
char.index(2)16=16@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor])。数値型。Haystack 中で needle が最初に現れる文字位置を示す数値を返します。省略可能な 3 つ目の引数 divisor は、needle を個別の文字列に分割するときに使用する文字数です。各部分文字列は検索に使用され、関数は任意の部分文字列の最初に発生した値を返します。たとえば、CHAR.INDEX(var1, 'abcd') は、文字列変数 var1 中の完全な文字列「abcd」が現れた最初の位置の値を返します。CHAR.INDEXX(var1, 'abcd', 1) は、「a」、「b」、「c」、「d」のいずれかの文字列が最初に現れた位置の値を返します。また、CHAR.INDEX(var1, 'abcd', 2) は、「ab」または「cd」のどちらかが最初に現れた位置の値を返します。divisor は、needle の長さを割り切ることができる、正の整数にする必要があります。needle が haystack 内に見つからない場合、0 を返します。
char.index(3)16=16@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor])。数値型。Haystack 中で needle が最初に現れる文字位置を示す数値を返します。省略可能な 3 つ目の引数 divisor は、needle を個別の文字列に分割するときに使用する文字数です。各部分文字列は検索に使用され、関数は任意の部分文字列の最初に発生した値を返します。たとえば、CHAR.INDEX(var1, 'abcd') は、文字列変数 var1 中の完全な文字列「abcd」が現れた最初の位置の値を返します。CHAR.INDEXX(var1, 'abcd', 1) は、「a」、「b」、「c」、「d」のいずれかの文字列が最初に現れた位置の値を返します。また、CHAR.INDEX(var1, 'abcd', 2) は、「ab」または「cd」のどちらかが最初に現れた位置の値を返します。divisor は、needle の長さを割り切ることができる、正の整数にする必要があります。needle が haystack 内に見つからない場合、0 を返します。
char.index(2)13=13@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor])。数値型。Haystack 中で needle が最初に現れる文字位置を示す数値を返します。省略可能な 3 つ目の引数 divisor は、needle を個別の文字列に分割するときに使用する文字数です。各部分文字列は検索に使用され、関数は任意の部分文字列の最初に発生した値を返します。たとえば、CHAR.INDEX(var1, 'abcd') は、文字列変数 var1 中の完全な文字列「abcd」が現れた最初の位置の値を返します。CHAR.INDEXX(var1, 'abcd', 1) は、「a」、「b」、「c」、「d」のいずれかの文字列が最初に現れた位置の値を返します。また、CHAR.INDEX(var1, 'abcd', 2) は、「ab」または「cd」のどちらかが最初に現れた位置の値を返します。divisor は、needle の長さを割り切ることができる、正の整数にする必要があります。needle が haystack 内に見つからない場合、0 を返します。
char.index(3)13=13@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor])。数値型。Haystack 中で needle が最初に現れる文字位置を示す数値を返します。省略可能な 3 つ目の引数 divisor は、needle を個別の文字列に分割するときに使用する文字数です。各部分文字列は検索に使用され、関数は任意の部分文字列の最初に発生した値を返します。たとえば、CHAR.INDEX(var1, 'abcd') は、文字列変数 var1 中の完全な文字列「abcd」が現れた最初の位置の値を返します。CHAR.INDEXX(var1, 'abcd', 1) は、「a」、「b」、「c」、「d」のいずれかの文字列が最初に現れた位置の値を返します。また、CHAR.INDEX(var1, 'abcd', 2) は、「ab」または「cd」のどちらかが最初に現れた位置の値を返します。divisor は、needle の長さを割り切ることができる、正の整数にする必要があります。needle が haystack 内に見つからない場合、0 を返します。
char.length16=16@Char.Length@CHAR.LENGTH(?)@CHAR.LENGTH(strexpr)。数値型。文字型 strexpr の右側にあるスペースを削除します。
char.lpad(2)16=16@Char.Lpad(2)@CHAR.LPAD(?,?)@CHAR.LPAD(strexpr1,length[,strexpr2])。文字列。strexpr2 を文字詰め文字列として必要な数だけ複製することによって、strexpr1 を length で指定した値の長さまで左に延長します。文字数を表す length の値は正の整数である必要があります。省略可能な引数 strexpr2 を省略した場合、空白文字で文字詰めされます。
char.lpad(3)16=16@Char.Lpad(3)@CHAR.LPAD(?,?,?)@CHAR.LPAD(strexpr1,length[,strexpr2])。文字列。strexpr2 を文字詰め文字列として必要な数だけ複製することによって、strexpr1 を length で指定した値の長さまで左に延長します。文字数を表す length の値は正の整数である必要があります。省略可能な引数 strexpr2 を省略した場合、空白文字で文字詰めされます。
char.mblen16=16@Char.Mblen@CHAR.mblen(?,?)@CHAR.MBLEN(strexpr,pos)。数値型。strexpr 内の指定した位置 pos にある文字のバイト数を返します。
char.rindex(2)16=16@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor])。数値型。文字型 haystack の中の文字型 needle が最後に現われた開始位置を示す整数を返します。省略可能な 3 つ目の引数 divisor は、needle を個別の文字列に分割するときに使用する文字数です。たとえば、CHAR.RINDEX(var1, 'abcd') は、変数 var1 中の完全な文字列「abcd」が最後に現れた開始位置を返します。CHAR.RINDEX(var1, 'abcd', 1) は、「a」、「b」、「c」、「d」のいずれかの文字列が最後に現れた開始位置の値を返します。また、CHAR.RINDEX(var1, 'abcd', 2) は、「ab」または「cd」が最後に現れた開始位置を返します。divisor は、needle の長さを割り切ることができる、正の整数にする必要があります。needle がない場合、値 0 が返されます。
char.rindex(3)16=16@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor])。数値型。文字型 haystack の中の文字型 needle が最後に現われた開始位置を示す整数を返します。省略可能な 3 つ目の引数 divisor は、needle を個別の文字列に分割するときに使用する文字数です。たとえば、CHAR.RINDEX(var1, 'abcd') は、変数 var1 中の完全な文字列「abcd」が最後に現れた開始位置を返します。CHAR.RINDEX(var1, 'abcd', 1) は、「a」、「b」、「c」、「d」のいずれかの文字列が最後に現れた開始位置の値を返します。また、CHAR.RINDEX(var1, 'abcd', 2) は、「ab」または「cd」が最後に現れた開始位置を返します。divisor は、needle の長さを割り切ることができる、正の整数にする必要があります。needle がない場合、値 0 が返されます。
char.rindex(2)13=13@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor])。数値型。文字型 haystack の中の文字型 needle が最後に現われた開始位置を示す整数を返します。省略可能な 3 つ目の引数 divisor は、needle を個別の文字列に分割するときに使用する文字数です。たとえば、CHAR.RINDEX(var1, 'abcd') は、変数 var1 中の完全な文字列「abcd」が最後に現れた開始位置を返します。CHAR.RINDEX(var1, 'abcd', 1) は、「a」、「b」、「c」、「d」のいずれかの文字列が最後に現れた開始位置の値を返します。また、CHAR.RINDEX(var1, 'abcd', 2) は、「ab」または「cd」が最後に現れた開始位置を返します。divisor は、needle の長さを割り切ることができる、正の整数にする必要があります。needle がない場合、値 0 が返されます。
char.rindex(3)13=13@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor])。数値型。文字型 haystack の中の文字型 needle が最後に現われた開始位置を示す整数を返します。省略可能な 3 つ目の引数 divisor は、needle を個別の文字列に分割するときに使用する文字数です。たとえば、CHAR.RINDEX(var1, 'abcd') は、変数 var1 中の完全な文字列「abcd」が最後に現れた開始位置を返します。CHAR.RINDEX(var1, 'abcd', 1) は、「a」、「b」、「c」、「d」のいずれかの文字列が最後に現れた開始位置の値を返します。また、CHAR.RINDEX(var1, 'abcd', 2) は、「ab」または「cd」が最後に現れた開始位置を返します。divisor は、needle の長さを割り切ることができる、正の整数にする必要があります。needle がない場合、値 0 が返されます。
char.rpad(2)16=16@Char.Rpad(2)@CHAR.RPAD(?,?)@CHAR.RPAD(strexpr1,length[,strexpr2])。文字列。strexpr2 を文字詰め文字列として必要な数だけ複製することによって、strexpr1 を length で指定した値の長さまで右に延長します。文字数を表す length の値は正の整数である必要があります。省略可能な 3 番目の引数 strexpr2 は、アポストロフィで囲まれた文字列または文字列を生成する式になります。strexpr2 を省略した場合、空白文字で文字詰めされます。
char.rpad(3)16=16@Char.Rpad(3)@CHAR.RPAD(?,?,?)@CHAR.RPAD(strexpr1,length[,strexpr2])。文字列。strexpr2 を文字詰め文字列として必要な数だけ複製することによって、strexpr1 を length で指定した値の長さまで右に延長します。文字数を表す length の値は正の整数である必要があります。省略可能な 3 番目の引数 strexpr2 は、アポストロフィで囲まれた文字列または文字列を生成する式になります。strexpr2 を省略した場合、空白文字で文字詰めされます。
char.substr(2)16=16@Char.Substr(2)@CHAR.SUBSTR(?,?)@CHAR.SUBSTR(strexpr,pos[,length])。文字列。strexpr の位置 pos で始まる分の文字列を戻します。任意の 3 つ目の引数は部分文字列の文字数を表します。任意の引数 length を省略した場合は、strexpr の pos 文字目から最後までの部分文字列を返します。たとえば、CHAR.SUBSTR('abcd', 2) は「bcd」を返し、CHAR.SUBSTR('abcd', 2, 2) は「bc」を返します。
char.substr(3)16=16@Char.Substr(3)@CHAR.SUBSTR(?,?,?)@CHAR.SUBSTR(strexpr,pos[,length])。文字列。strexpr の位置 pos で始まる分の文字列を戻します。任意の 3 つ目の引数は部分文字列の文字数を表します。任意の引数 length を省略した場合は、strexpr の pos 文字目から最後までの部分文字列を返します。たとえば、CHAR.SUBSTR('abcd', 2) は「bcd」を返し、CHAR.SUBSTR('abcd', 2, 2) は「bc」を返します。
concat16=16@Concat@CONCAT(?,?)@CONCAT(strexpr,strexpr[,..])。文字列。すべての引数を連結した文字型の値を返します。いずれも文字型である必要があります。この関数には 2 つ以上の引数が必要です。コード ページ モードでは、strexpr が文字型変数のとき、指定された変数の幅の左端に文字列を寄せずに実際の文字列を取得する場合にのみ RTRIM を使用します。たとえば、CONCAT(RTRIM(stringvar1), RTRIM(stringvar2)) と指定できます。
cos1=1@Cos@COS(?)@COS(radians)。数値型。radians の余弦を返します。radians はラジアン単位の数値である必要があります。
ctime.days18=18@Ctime.Days@CTIME.DAYS(?)@CTIME.DAYS(timevalue)。数値型。timevalue に基づいて、小数点付き日数を含む日数を返します。timevalue には、秒数、または時間書式の数字や式を指定します。
ctime.hours18=18@Ctime.Hours@CTIME.HOURS(?)@CTIME.HOURS(timevalue)。数値型。timevalue に基づいて、小数点付き時間を含む時間数を返します。timevalue には、秒数、または時間書式の数字や式を指定します。
ctime.minutes18=18@Ctime.Minutes@CTIME.MINUTES(?)@CTIME.MINUTES(timevalue)。数値型。timevalue に基づいて、小数点付き分を含む分数を返します。timevalue には、���数、または時間書式の数字や式を指定します。
ctime.seconds18=18@Ctime.Seconds@CTIME.SECONDS(?)@CTIME.SECONDS(timevalue)。数値型。timevalue に基づいて、小数点付き秒を含む秒数を返します。timevalue には、秒数、または時間書式の数字や式を指定します。
date.dmy6=6@Date.Dmy@DATE.DMY(?,?,?)@DATE.DMY(day,month,year)。数値型。指定した day、month、および year に対応する日付値を返します。引数には整数を指定する必要があります。また、day は 1 ～ 31 の日、month は 1 ～ 13 の月となり、year は 1582 よりも大きい 4 桁の整数または最初の 19 を省略した 2 桁の年の整数です。結果を日付で表示するには、結果変数に日付書式を割り当てます。
date.mdy6=6@Date.Mdy@DATE.MDY(?,?,?)@DATE.MDY(month,day,year)。数値型。指定した month、day、および year に対応する日付の値を返します。引数には整数を指定する必要があります。また、day は 1 ～ 31 の日、month は 1 ～ 13 の月となり、year は 1582 よりも大きい 4 桁の整数または最初の 19 を省略した 2 桁の年の整数です。結果を日付で表示するには、結果変数に日付書式を割り当てます。
date.moyr6=6@Date.Moyr@DATE.MOYR(?,?)@DATE.MOYR(month,year)。数値型。指定した month、および year に対応する日付の値を返します。引数には整数を指定する必要があります。また、month は 1 ～ 13 の月、year は 1582 よりも大きい 4 桁の整数または最初の 19 を省略した 2 桁の年の整数です。結果を日付で表示するには、結果変数に日付書式を割り当てます。
date.qyr6=6@Date.Qyr@DATE.QYR(?,?)@DATE.QYR(quarter,year)。数値型。指定した quarter と year に対応する日付の値を返します。引数には整数を指定する必要があります。また、quarter は 1 ～ 4 の季、year は 1582 よりも大きい 4 桁の整数または最初の 19 を省略した 2 桁の年の整数です。結果を日付で表示するには、結果変数に日付書式を割り当てます。
date.wkyr6=6@Date.Wkyr@DATE.WKYR(?,?)@DATE.WKYR(weeknum,year)。数値型。指定した weeknum および year に対応する日付の値を返します。 引数には整数を指定する必要があります。また、weeknum は 1 ～ 53 の週番号、year は 1582 よりも大きい 4 桁の整数です。返される日付の値は、その年の指定された週の最初の日を表します。 第 1 週は、各年の 1 月 1 日に始まります。したがって年が違うと、同じ週番号でも返される日付は異なります。結果を日付で表示するには、結果変数に日付書式を適用します。
date.yrday6=6@Date.Yrday@DATE.YRDAY(?,?)@DATE.YRDAY(year,daynum)。数値型。指定した year および daynum に対応する日付の値を返します。引数には整数を指定する必要があります���また、daynum は 1 ～ 366 の日番号、year は 1582 よりも大きい 4 桁の整数または最初の 19 を省略した 2 桁の年の整数です。結果を日付で表示するには、結果変数に日付書式を割り当てます。
datediff5=5@Datediff@DATEDIFF(?,?,?)@DATEDIFF(datetime2, datetime1, "unit")。数値型。 2 つの日付/の差異を計算し、指定された日付/時間で整数を返します (小数点を切り捨て)。datetime2 と datetime1 は、両方とも日付または時間形式の変数です (有効な日付/時間を表す数値)。"unit" は引用符で囲まれた以下の文字列リテラル値で、次のうちのいずれかを指定します。 years、quarters、months、weeks、days、hours、minutes、seconds。
datesum(3)5=5@Datesum(3)@DATESUM(?,?,?)@DATESUM(datetime, value, "unit", "method")。数値型。 所定の日付あるいは時間から、指定された単位の日付か時間を計算します。datetime は、両方とも日付または時間形式の変数です (有効な日付/時間を表す数値)。"unit" は引用符で囲まれた以下の文字列リテラル値の 1 つです。 years、quarters、months、weeks、days、hours、minutes、seconds。引用符で囲まれた方式 (省略可能) は、「ロールオーバー」か、あるいは「最接近」が可能です。ロールオーバー方式は、超過日を翌月へ繰り上げます。最接近方式は、その月内に最も近い正当な日付を使用します。これはデフォルトになります。返された値は、秒単位の日付/時間です。日付/時間として値を表示するには、変数に適切な形式を割り当ててください。
datesum(4)5=5@Datesum(4)@DATESUM(?,?,?,?)@DATESUM(datetime, value, "unit", "method")。数値型。 所定の日付あるいは時間から、指定された単位の日付か時間を計算します。datetime は、両方とも日付または時間形式の変数です (有効な日付/時間を表す数値)。"unit" は引用符で囲まれた以下の文字列リテラル値の 1 つです。 years、quarters、months、weeks、days、hours、minutes、seconds。引用符で囲まれた方式 (省略可能) は、「ロールオーバー」か、あるいは「最接近」が可能です。ロールオーバー方式は、超過日を翌月へ繰り上げます。最接近方式は、その月内に最も近い正当な日付を使用します。これはデフォルトになります。返された値は、秒単位の日付/時間です。日付/時間として値を表示するには、変数に適切な形式を割り当ててください。
exp1=1@Exp@EXP(?)@EXP(numexpr)。数値型。e の numexpr 乗を返します。e は自然対数の底で numexpr は数値です。numexpr の値が非常に大きい場合は、コンピューターの能力を超える結果が発生する場合があります。
idf.beta8=8@Idf.Beta@IDF.BETA(?,?,?)@IDF.BETA(prob, shape1, shape2)。数値型。指定の shape パラメータを持つベータ分布から、累積確率が prob と等しくなる値を取��出して返します。
idf.cauchy8=8@Idf.Cauchy@IDF.CAUCHY(?,?,?)@IDF.CAUCHY(prob, loc, scale)。数値型。指定の location および scale パラメータを持つコーシー分布から、累積確率が prob と等しくなる値を取り出して返します。
idf.chisq8=8@Idf.Chisq@IDF.CHISQ(?,?)@IDF.CHISQ(prob, df)。数値型。指定の自由度 df を持つカイ 2 乗分布から、累積確率が prob と等しくなる値を取り出して返します。たとえば、自由度 3 の 0.05 レベルで有意なカイ 2 乗の値は IDF.CHISQ (0.95,3) です。
idf.exp8=8@Idf.Exp@IDF.EXP(?,?)@IDF.EXP(p, scale)。数値型。指定の減衰比率 scale を持つ指数減衰変数から、累積確率が p と等しくなる値を取り出して返します。
idf.f8=8@Idf.F@IDF.F(?,?,?)@IDF.F(prob, df1, df2)。数値型。指定の自由度を持つ F 分布から、累積確率が prob と等しくなる値を取り出して返します。たとえば、自由度 3 および 100 の 0.05 レベルで有意な F 分布は IDF.F (0.95,3,100) です。
idf.gamma8=8@Idf.Gamma@IDF.GAMMA(?,?,?)@IDF.GAMMA(prob, shape, scale)。数値型。累積確率が prob と等しくなる値を、指定の shape および scale パラメータを持つガンマ分布から取り出して返します。
idf.halfnrm8=8@Idf.Halfnrm@IDF.HALFNRM(?)@IDF.HALFNRM(prob, mean, stddev)。数値型。指定の mean および標準偏差 stddev を持つ半正規分布から、累積確率が prob と等しくなる値を取り出して返します。
idf.igauss8=8@Idf.Igauss@IDF.IGAUSS(?,?,?)@IDF.IGAUSS(prob, loc, scale)。数値型。指定の location および scale パラメータを持つ逆ガウス分布から、累積確率が prob と等しくなる値を取り出して返します。
idf.laplace8=8@Idf.Laplace@IDF.LAPLACE(?,?,?)@IDF.LAPLACE(prob, mean, scale)。数値型。指定の mean および scale パラメータを持つラプラス分布から、累積確率が prob と等しくなる値を取り出して返します。
idf.lnormal8=8@Idf.Lnormal@IDF.LNORMAL(?,?,?)@IDF.LNORMAL(prob, a, b)。数値型。指定のパラメータを持つ対数正規分布から、累積確率が prob と等しくなる値を取り出して返します。
idf.logistic8=8@Idf.Logistic@IDF.LOGISTIC(?,?,?)@IDF.LOGISTIC(prob, mean, scale)。数値型。指定の mean および scale パラメータを持つロジスティック分布から、累積確率が prob と等しくなる値を取り出して返します。
idf.normal8=8@Idf.Normal@IDF.NORMAL(?,?,?)@IDF.NORMAL(prob, mean, stddev)。数値型。指定の mean および標準偏差 stddev を持つ正規分布から、累積確率が prob と等しくなる値を取り出して返します。
idf.pareto8=8@Idf.Pareto@IDF.PARETO(?,?,?)@IDF.PARETO(prob, threshold, shape)。数値型。指定の threshold および sacle パラメータを持つパレート分布から、累積確率が prob と等しくなる値を取り出して返します。
idf.smod8=8@Idf.Smod@IDF.SMOD(?)@IDF.SMOD(prob, a, b)。数値型。指定のパラメータを持つスチューデント化された最大法から、累積確率が prob と等しくなる値を取り出して返します。
idf.srange8=8@Idf.Srange@IDF.SRANGE(?)@IDF.SRANGE(prob, a, b)。数値型。指定のパラメータを持つスチューデント化された範囲統計量から、累積確率が prob と等しくなる値を取り出して返します。
idf.t8=8@Idf.T@IDF.T(?,?)@IDF.T(prob, df)。数値型。指定の自由度 df を持つスチューデント t 分布から、累積確率が prob と等しくなる値を取り出して返します。
idf.uniform8=8@Idf.Uniform@IDF.UNIFORM(?,?,?)@IDF.UNIFORM(prob, min, max)。数値型。min から max までの一様分布から、累積確率が prob と等しくなる値を取り出して返します。
idf.weibull8=8@Idf.Weibull@IDF.WEIBULL(?,?,?)@IDF.WEIBULL(prob, a, b)。数値型。指定のパラメータを持つワイブル分布から、累積確率が prob と等しくなる値を取り出して返します。
lag(1)9=9@Lag(1)@LAG(?)@LAG(variable[, n])。数値型または文字型。前のケースまたは n ケース前の変数の値。任意の 2 番目の引数 n は正の整数でなければなりません (デフォルトは 1)。たとえば、prev4=LAG(gnp,4) と指定した場合、変数 prev4 の 5 番目のケースから gnp の値を返します。最初の 4 ケースには、prev4 のシステム欠損値が入ります。
lag(2)9=9@Lag(2)@LAG(?,?)@LAG(variable[, n])。数値型または文字型。前のケースまたは n ケース前の変数の値。任意の 2 番目の引数 n は正の整数でなければなりません (デフォルトは 1)。たとえば、prev4=LAG(gnp,4) と指定した場合、変数 prev4 の 5 番目のケースから gnp の値を返します。最初の 4 ケースには、prev4 のシステム欠損値が入ります。
length16=16@Length@LENGTH(?)@LENGTH(strexpr)。数値型。strexpr のバイト長を返します。strexpr は文字式である必要があります。文字型変数の場合は、Unicode 形式では接尾空白を含まない各値のバイト数ですが、コード ページ形式では接尾空白を含む定義済み長さです。コード ページ形式では、右側にあるスペースを除去した長さ (バイト数) を得るには、LENGTH(RTRIM(strexpr)) を使用します。
lg101=1@Lg10@LG10(?)@LG10(numexpr)。数値型。numexp の底 10 対数を返します。numexpr は数値で、0 より大きい値である必要があります。
ln1=1@Ln@LN(?)@LN(numexpr)。数値型。numexpr の底 e 対数を返します。numexpr は数値で、0 より大きい値である必要があります。
lngamma1=1@Lngamma@LNGAMMA(?)@LNGAMMA(numexpr)。数値型。numexpr の完全なガンマ関数の対数を返します。numexpr は数値で、0 より大きい値である必要があります。
lower16=16@Lower@LOWER(?)@LOWER(strexpr)。文字列。大文字が小文字に変換され、他の文字は変換されずに返されます。引数には文字列変数または値を指定できます。たとえば、LOWER(name1) は、name1 の値が Charles の場合に charles を返します。
ltrim(1)16=16@Ltrim(1)@LTRIM(?)@LTRIM(strexpr[,char])。文字列。引数が 1 つの LTRIM と同じですが、strexpr の最初にある char を取り除きます。char を指定しない場合は、左側にあるスペースを取り除きます。char は 1 つの文字である必要があります。
ltrim(2)16=16@Ltrim(2)@LTRIM(?,?)@LTRIM(strexpr[,char])。文字列。引数が 1 つの LTRIM と同じですが、strexpr の最初にある char を取り除きます。char を指定しない場合は、左側にあるスペースを取り除きます。char は 1 つの文字である必要があります。
max13=13@Max@MAX(?,?)@MAX(value,value[,..])。数値型または文字型。有効な値を持つ引数の最大値を返します。この関数には 2 つ以上の引数が必要です。数値型の変数では、この関数が取る有効な引数の最小数を指定できます。
max15=15@Max@MAX(?,?)@MAX(value,value[,..])。数値型または文字型。有効な値を持つ引数の最大値を返します。この関数には 2 つ以上の引数が必要です。数値型の変数では、この関数が取る有効な引数の最小数を指定できます。
mblen.byte16=16@Mblen.Byte@MBLEN.BYTE(?,?)@MBLEN.BYTE(strexpr,pos)。数値型。strexpr 内の指定した位置 pos にある文字のバイト数を返し��す。
mean15=15@Mean@MEAN(?,?)@MEAN(numexpr,numexpr[,..])。数値型。有効な非欠損値を持つ引数の算術平均を返します。この関数には、2 つ以上の引数が必要です。この引数は、数値である必要があります。この関数が取る有効な引数の最小数を指定できます。
median15=15@Median@Median(?,?)@MEDIAN(numexpr,numexpr[,..])。数値型。有効な中央値 (50 パーセンタイル) を持つ引数の算術平均を返します。この関数には、2 つ以上の引数が必要です。この引数は、数値である必要があります。この関数が取る有効な引数の最小数を指定できます。
min13=13@Min@MIN(?,?)@MIN(value,value[,..])。数値型または文字型。有効な非欠損値を持つ引数の最小値を返します。この関数には 2 つ以上の引数が必要です。数値型の変数では、この関数が取る有効な引数の最小数を指定できます。
min15=15@Min@MIN(?,?)@MIN(value,value[,..])。数値型または文字型。有効な非欠損値を持つ引数の最小値を返します。この関数には 2 つ以上の引数が必要です。数値型の変数では、この関数が取る有効な引数の最小数を指定できます。
missing10=10@Missing@MISSING(?)@MISSING(variable)。論理型。variable にシステムまたはユーザーの欠損値がある場合は、1 または真を返します。引数は、作業中のアクティブ データセット内の変数名である必要があります。
mod1=1@Mod@MOD(?,?)@MOD(numexpr,modulus)。数値型。numexpr を modulus で割った余りを返します。両方の引数共に数値である必要があり、modulus は 0 であってはなりません。
ncdf.beta2=2@Ncdf.Beta@NCDF.BETA(?,?,?,?)@NCDF.BETA(quant, shape1, shape2, nc)。数値型。指定の shape および非心度 nc パラメータを持つ非心度ベータ分布から取り出された値が quant 未満になる累積確率を返します。
ncdf.chisq2=2@Ncdf.Chisq@NCDF.CHISQ(?,?,?)@NCDF.CHISQ(quant, df, nc)。数値型。指定の自由度 df および非心度 nc パラメータを持つ非心度カイ 2 乗分布から取り出された値が quant 未満になる累積確率を返します。
ncdf.f2=2@Ncdf.F@NCDF.F(?,?,?,?)@NCDF.F(quant, df1, df2, nc)。数値型。指定の自由度 df1 および df2 ならびに非心度 nc を持つ非心度 F 分布から取り出された値が quant 未満になる累積確率を返します。
ncdf.t2=2@Ncdf.T@NCDF.T(?,?,?)@NCDF.T(quant, df, nc)。数値型。指定の自由度 df および非心度 nc を持つ非心度スチューデント t 分布から取り出された値が quant 未満になる累積確率を返します。
nmiss10=10@Nmiss@NMISS(?)@NMISS(variable[,..])。数値型。システムとユーザー欠損値のある引数の個数を返します。この関数には 1 つ以上の引数が必要です。これらの引数は、アクティブなデータセットにある変数名である必要があります。
normalize16=16@Normalize@NORMALIZE(?)@NORMALIZE(strexp)。文字列。strexp の正規化されたバージョンを戻します。Unicode モードでは、Unicode NFC を戻します。コード ページ モードでは、効果はなく、未修正の strexp を戻します。結果の長さは入力の長さとは違います。
npdf.beta11=11@Npdf.Beta@NPDF.BETA(?,?,?,?)@NPDF.BETA(quant, shape1, shape2, nc)。数値型。指定の shape および noncentrality パラメータを持つ非心度ベータ分布の値が quant になる確率密度を返します。
npdf.chisq11=11@Npdf.Chisq@NPDF.CHISQ(?,?,?)@NPDF.CHISQ(quant, df, nc)。数値型。自由度 df および指定の noncentrality パラメータを持つ非心度カイ 2 乗分布の値が quant になる確率密度を返します。
npdf.f11=11@Npdf.F@NPDF.F(?,?,?,?)@NPDF.F(quant, df1, df2, nc)。数値型。自由度 df1 および df2、ならびに非心度 nc を持つ非心度 F 分布の値が quant になる確率密度を返します。
npdf.t11=11@Npdf.T@NPDF.T(?,?,?)@NPDF.T(quant, df, nc)。数値型。指定の自由度 df および非心度 nc を持つ非心度スチューデント t 分布の値が quant になる確率密度を返します。
ntrim16=16@Ntrim@NTRIM(?)@NTRIM(varname)。右側にあるスペースを削除しないで、varname の値を戻します。varname の値は変数名である必要があります。式にすることはできません。
number3=3@Number@NUMBER(?,?)@NUMBER(strexpr,format)。数値型。文字型式 strexpr の値を数値に変換して返します。2 番目の引数である format は、strexpr を読み込む際に使用する数値型書式の指定です。たとえば、NUMBER(stringDate、DATE11) は、一般形式 dd-mmm-yyyy の日付の文字列をその日付を表す秒数に変換します。日付で値を表示するには、FORMATS または PRINT FORMATS コマンドを使用します。この書式を使用しても文字が読み込めない場合、この関数はシステム欠損値を返します。
nvalid10=10@Nvalid@NVALID(?)@NVALID(variable[,..])。数値型。有効な非欠損値を持つ引���の度数を返します。この関数には 1 つ以上の引数が必要です。これらの引数は、アクティブなデータセットにある変数名である必要があります。
pdf.bernoulli11=11@Pdf.Bernoulli@PDF.BERNOULLI(?,?)@PDF.BERNOULLI(quant, prob)。数値型。指定の確率パラメータを持つベルヌーイ分布から取り出された値が quant と等しくなる確率を返します。
pdf.beta11=11@Pdf.Beta@PDF.BETA(?,?,?)@PDF.BETA(quant, shape1, shape2)。数値型。指定の shape パラメータを持つベータ分布の値が quant になる確率密度を返します。
pdf.binom11=11@Pdf.Binom@PDF.BINOM(?,?,?)@PDF.BINOM(quant, n, prob)。数値型。毎回の成功の確率が prob である分布で、n 回試行して成功した回数が quant と等しくなる確率を返します。n が 1 回であれば PDF.BERNOULLI と同じ値になります。
pdf.bvnor11=11@Pdf.Bvnor@PDF.BVNOR(?,?,?)@PDF.BVNOR(quant1, quant2, corr)。数値型。指定の correlation パラメータを持つ 2 変量の標準正規分布の値が quant1、quant2 になる確率密度を返します。
pdf.cauchy11=11@Pdf.Cauchy@PDF.CAUCHY(?,?,?)@PDF.CAUCHY(quant, loc, scale)。数値型。指定の location および scale パラメータを持つコーシー分布の値が quant になる確率密度を返します。
pdf.chisq11=11@Pdf.Chisq@PDF.CHISQ(?,?)@PDF.CHISQ(quant, df)。数値型。自由度 df を持つカイ 2 乗分布の値が quant になる確率密度を返します。
pdf.exp11=11@Pdf.Exp@PDF.EXP(?,?)@PDF.EXP(quant, shape)。数値型。指定の shape パラメータを持つ指数分布の値が quant になる確率密度を返します。
pdf.f11=11@Pdf.F@PDF.F(?,?,?)@PDF.F(quant, df1, df2)。数値型。自由度 df1 および df2 を持つ F 分布の値が quant になる確率密度を返します。
pdf.gamma11=11@Pdf.Gamma@PDF.GAMMA(?,?,?)@PDF.GAMMA(quant, shape, scale)。数値型。指定の shape および scale パラメータを持つガンマ分布の値が quant になる確率密度を返します。
pdf.geom11=11@Pdf.Geom@PDF.GEOM(?,?)@PDF.GEOM(quant, prob)。数値型。成功の確率が prob である分布で、1 回の成功を得るために必要な試行の回数が quant と等しくなる確率を返します。
pdf.halfnrm11=11@Pdf.Halfnrm@PDF.HALFNRM(?,?,?)@PDF.HALFNRM(quant, mean, stddev)。数値型。指定の mean および標準偏差 stddev を持つ半正規分布の値が quant になる確率密度を返します。
pdf.hyper11=11@Pdf.Hyper@PDF.HYPER(?,?,?,?)@PDF.HYPER(quant, total, sample, hits)。数値型。サイズが total であるユニバースから、sample 個のオブジェクトを無作為に抽出したときに、指定された文字 hits を含むオブジェクトの個数の値が quant と等しくなる確率を返します。
pdf.igauss11=11@Pdf.Igauss@PDF.IGAUSS(?,?,?)@PDF.IGAUSS(quant, loc, scale)。数値型。指定の location および scale パラメータを持つ逆ガウス分布の値が quant になる確率密度を返します。
pdf.laplace11=11@Pdf.Laplace@PDF.LAPLACE(?,?,?)@PDF.LAPLACE(quant, mean, scale)。数値型。指定の mean および scale パラメータを持つラプラス分布の値が quant になる確率密度を返します。
pdf.lnormal11=11@Pdf.Lnormal@PDF.LNORMAL(?,?,?)@PDF.LNORMAL(quant, a, b)。数値型。指定のパラメータを持つ対数正規分布の値が quant になる確率密度を返します。
pdf.logistic11=11@Pdf.Logistic@PDF.LOGISTIC(?,?,?)@PDF.LOGISTIC(quant, mean, scale)。数値型。指定の mean および scale パラメータを持つロジスティック分布の値が quant になる確率密度を返します。
pdf.negbin11=11@Pdf.Negbin@PDF.NEGBIN(?,?,?)@PDF.NEGBIN(quant, thresh, prob)。数値型。閾値パラメータが thresh であり、成功の確率が prob である時に、1 回の成功を得るために必要な試行の回数が quant と等しくなる確率を返します。
pdf.normal11=11@Pdf.Normal@PDF.NORMAL(?,?,?)@PDF.NORMAL(quant, mean, stddev)。数値型。指定の mean および標準偏差 stddev を持つ正規分布の値が quant になる確率密度を返します。
pdf.pareto11=11@Pdf.Pareto@PDF.PARETO(?,?,?)@PDF.PARETO(quant, threshold, shape)。数値型。指定の threshold および shape パラメータを持つパレート分布の値が quant になる確率密度を返します。
pdf.poisson11=11@Pdf.Poisson@PDF.POISSON(?,?)@PDF.POISSON(quant, mean)。数値型。指定の mean および比率パラメータを持つポアソン分布から取り出された値が quant と等しくなる確率を返します。
pdf.t11=11@Pdf.T@PDF.T(?,?)@PDF.T(quant, df)。数値型。指定の自由度 df を持つスチューデント t 分布の値が quant になる確率密度を返します。
pdf.uniform11=11@Pdf.Uniform@PDF.UNIFORM(?,?,?)@PDF.UNIFORM(quant, min, max)。数値型。指定の minimum および maximum を持つ一様分布の値が quant になる確率密度を返します。
pdf.weibull11=11@Pdf.Weibull@PDF.WEIBULL(?,?,?)@PDF.WEIBULL(quant, a, b)。数値型。指定のパラメータを持つワイブル分布の値が quant になる確率密度を返します。
range13=13@Range@RANGE(?,?,?)@RANGE(test,lo,hi[,lo,hi,..])。論理型。test が lo、hi のペアで定義された範囲内である場合、1 または真を返します。引数はすべて数値か、同じ長さの文字型である必要があります。lo、hi の各ペアは lo <= hi の順番になっている必要があります。注 :文字列型の値では、国により異なる照合順序が使用されるため、同じ文字セットに対してもロケールにより結果が異なります。ASCII 順ではなく言語順によって、特定の文字が置かれる順序が決定されます。
replace(3)13=13@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4])。文字列。a1 では、a2 のインスタンスは a3 に置換されます。省略可能な引数 a4 は、置換するべき出現数を指定します。a4 が省略されると、出現がすべて置換されます。引数 a1、a2 および a3 は、文字列値にする必要があります (引用符で囲まれたリテラル文字列あるいは文字列変数)。また、省略可能な引数 a4 は負以外の整数にする必要があります。たとえば、REPLACE("abcabc", "a", "x") は「xbcxbc」の値を返し、REPLACE("abcabc", "a", "x", 1) は「xbcabc」の値を返します。
replace(4)13=13@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4])。文字列。a1 では、a2 のインスタンスは a3 に置換されます。省略可能な引数 a4 は、置換するべき出現数を指定します。a4 が省略されると、出現がすべて置換されます。引数 a1、a2 および a3 は、文字列値にする必要があります (引用符で囲まれたリテラル文字列あるいは文字列変数)。また、省略可能な引数 a4 は負以外の整数にする必要があります。たとえば、REPLACE("abcabc", "a", "x") は「xbcxbc」の値を返し、REPLACE("abcabc", "a", "x", 1) は「xbcabc」の値を返します。
replace(3)16=16@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4])。文字列。a1 では、a2 のインスタンスは a3 に置換されます。省略可能な引数 a4 は、置換するべき出現数を指定します。a4 が省略されると、出現がすべて置換されます。引数 a1、a2 および a3 は、文字列値にする必要があります (引用符で囲まれたリテラル文字列あるいは文字列変数)。また、省略可能な引数 a4 は負以外の整数にする必要があります。たとえば、REPLACE("abcabc", "a", "x") は「xbcxbc」の値を返し、REPLACE("abcabc", "a", "x", 1) は「xbcabc」の値を返します。
replace(4)16=16@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4])。文字列。a1 では、a2 のインスタンスは a3 に置換されます。省略可能な引数 a4 は、置換するべき出現数を指定します。a4 が省略されると、出現がすべて置換されます。引数 a1、a2 および a3 は、文字列値にする必要があります (引用符で囲まれたリテラル文字列あるいは文字列変数)。また、省略可能な引数 a4 は負以外の整数にする必要があります。たとえば、REPLACE("abcabc", "a", "x") は「xbcxbc」の値を返し、REPLACE("abcabc", "a", "x", 1) は「xbcabc」の値を返します。
rnd(1)1=1@Rnd(1)@RND(?)@RND(numexpr[,mult,fuzzbits])。数値型。引数が 1 つの場合、その引数に最も近い整数を返します。末尾がちょうと .5 で終わる数は、0 から離れる方向に丸められます。たとえば、RND(-4.5) は -5 に丸められます。省略可能な 2 番目の引数、mult は、丸めの結果をその値の整数倍にすることを指定します。たとえば、RND(-4.57,0.1) = -4.6 となります。この値は ０ 以外の数値を指定します。デフォルトは 1 です。省略可能な 3番目の引数 fuzzbits は、numexpr が切り上げの閾値 (整数に切り上げる場合 0.5) に満たない可能性があるが切り上げられる最小有意ビット数です。省略した場合、システム設定の FUZZBITS (インストール時に 6 に設定されます) が使用されます。
rnd(2)1=1@Rnd(2)@RND(?,?)@RND(numexpr[,mult,fuzzbits])。数値型。引数が 1 つの場合、その引数に最も近い整数を返します。末尾がちょうと .5 で終わる数は、0 から離れる方向に丸められます。たとえば、RND(-4.5) は -5 に丸められます。省略可能な 2 番目の引数、mult は、丸めの結果をその値の整数倍にすることを指定します。たとえば、RND(-4.57,0.1) = -4.6 となります。この値は ０ 以外の数値を指定します。デフォルトは 1 です。省略可能な 3番目の引数 fuzzbits は、numexpr が切り上げの閾値 (整数に切り上げる場合 0.5) に満たない可能性があるが切り上げられる最小有意ビット数です。省略した場合、システム設定の FUZZBITS (インストール時に 6 に設定されます) が使用されます。
rnd(3)1=1@Rnd(3)@RND(?,?,?)@RND(numexpr[,mult,fuzzbits])。数値型。引数が 1 つの場合、その引数に最も近い整数を返します。末尾がちょうと .5 で終わる数は、0 から離れる方向に丸められます。たとえば、RND(-4.5) は -5 に丸められます。省略可能な 2 番目の引数、mult は、丸めの結果をその値の整数倍にすることを指定します。たとえば、RND(-4.57,0.1) = -4.6 となります。この値は ０ 以外の数値を指定します。デフォルトは 1 です。省略可能な 3番目の引数 fuzzbits は、numexpr が切り上げの閾値 (整数に切り上げる場合 0.5) に満たない可能性があるが切り上げられる最小有意ビット数です。省略した場合、システム設定の FUZZBITS (インストール時に 6 に設定されます) が使用されます。
rtrim(1)16=16@Rtrim(1)@RTRIM(?)@RTRIM(strexpr[,char])。文字列。strexpr の末尾にある char を取り除きます。省略可能な 2 番目の引数 char は、アポストロフィに囲まれた単一文字または単一文字を生成する式になります。char を省略すると、末尾にあるスペースが取り除かれます。
rtrim(2)16=16@Rtrim(2)@RTRIM(?,?)@RTRIM(strexpr[,char])。文字列。strexpr の末尾にある char を取り除きます。省略可能な 2 番目の引数 char は、アポストロフィに囲まれた単一文字または単一文字を生成する式になります。char を省略すると、末尾にあるスペースが取り除かれます。
rv.bernoulli12=12@Rv.Bernoulli@RV.BERNOULLI(?)@RV.BERNOULLI(prob)。数値型。指定の確率パラメータ prob を持つベルヌーイ分布から乱数変数を取り出して返します。
rv.beta12=12@Rv.Beta@RV.BETA(?,?)@RV.BETA(shape1, shape2)。数値型。指定のパラメータ shape を持つベータ分布から乱数変数を取り出して返します。
rv.binom12=12@Rv.Binom@RV.BINOM(?,?)@RV.BINOM(n, prob)。数値型。検定指定の number および probability パラメータを持つ 2 項分布から乱数変数を取り出して返します。
rv.cauchy12=12@Rv.Cauchy@RV.CAUCHY(?,?)@RV.CAUCHY(loc, scale)。数値型。指定の location および scale パラメータを持つコーシー分布から乱数変数を取り出して返します。
rv.chisq12=12@Rv.Chisq@RV.CHISQ(?)@RV.CHISQ(df)。数値型。指定の自由度 df を持つカイ 2 乗分布から乱数変数を取り出して返します。
rv.exp12=12@Rv.Exp@RV.EXP(?)@RV.EXP(scale)。数値型。指定の scale パラメータを持つ指数分布から乱数変数を取り出して返します。
rv.f12=12@Rv.F@RV.F(?,?)@RV.F(df1, df2)。数値型。指定の自由度 df1 および df2 を持つ F 分布から乱数変数を取り出して返します。
rv.gamma12=12@Rv.Gamma@RV.GAMMA(?,?)@RV.GAMMA(shape, scale)。数値型。指定の shape および scale パラメータを持つガンマ分布から乱数変数を取り出して返します。
rv.geom12=12@Rv.Geom@RV.GEOM(?)@RV.GEOM(prob)。数値型。指定の probability パラメータを持つ幾何分布から乱数変数を取り出して返します。
rv.halfnrm12=12@Rv.Halfnrm@RV.HALFNRM(?)@RV.HALFNRM(mean, stddev)。数値型。指定の mean および標準偏差 stddev を持つ半正規分布から乱数変数を取り出して返します。
rv.hyper12=12@Rv.Hyper@RV.HYPER(?,?,?)@RV.HYPER(total, sample, hits)。数値型。指定のパラメータを持つ超幾何分布から乱数変数を取り出して返します。
rv.igauss12=12@Rv.Igauss@RV.IGAUSS(?,?)@RV.IGAUSS(loc, scale)。数値型。指定の location および scale パラメータを持つ逆ガウス分布から乱数変数を取り出して返します。
rv.laplace12=12@Rv.Laplace@RV.LAPLACE(?,?)@RV.LAPLACE(mean, scale)。数値型。指定の mean および scale パラメータを持つラプラス分布から乱数変数を取り出して返します。
rv.lnormal12=12@Rv.Lnormal@RV.LNORMAL(?,?)@RV.LNORMAL(a, b)。数値型。指定のパラメータを持つ対数正規分布から乱数変数を取り出して返します。
rv.logistic12=12@Rv.Logistic@RV.LOGISTIC(?,?)@RV.LOGISTIC(mean, scale)。数値型。指定の mean および scale パラメータを持つロジスティック分布から乱数変数を取り出して返します。
rv.negbin12=12@Rv.Negbin@RV.NEGBIN(?,?)@RV.NEGBIN(threshold, prob)。数値型。指定の閾値 threshold および確率 prob パラメータを持つ負の 2 項分布から乱数変数を取り出して返します。
rv.normal12=12@Rv.Normal@RV.NORMAL(?,?)@RV.NORMAL(mean, stddev)。数値型。指定の mean および標準偏差 stddev を持つ正規分布から乱数変数を取り出して返します。
rv.pareto12=12@Rv.Pareto@RV.PARETO(?,?)@RV.PARETO(threshold, shape)。数値型。指定の threshold および shape を持つパレート分布から乱数変数を取り出して返します。
rv.poisson12=12@Rv.Poisson@RV.POISSON(?)@RV.POISSON(mean)。数値型。指定の mean または比率パラメータを持つポアソン分布から乱数変数を取り出して返します。
rv.t12=12@Rv.T@RV.T(?)@RV.T(df)。数値型。指定の自由度 df を持つスチューデント t 分布から乱数変数を取り出して返します。
rv.uniform12=12@Rv.Uniform@RV.UNIFORM(?,?)@RV.UNIFORM(min, max)。数値型。指定の minimum および maximum を持つ一様分布から乱数変数を取り出して返します。UNIFORM 関数を参照してください。
rv.weibull12=12@Rv.Weibull@RV.WEIBULL(?,?)@RV.WEIBULL(a, b)。数値型。指定のパラメータを持つワイブル分布から乱数変数を取り出して返します。
sd15=15@Sd@SD(?,?)@SD(numexpr,numexpr[,..])。数値型。非欠損値を持つ引数の標準偏差を返します。この関数には、2 つ以上の引数が必要です。この引数は、数値である必要があります。この関数が取る有効な引数の最小数を指定できます。
sig.chisq14=14@Sig.Chisq@SIG.CHISQ(?)@SIG.CHISQ(quant, df)。数値型。自由度 df を持つカイ 2 乗分布から取り出された値が quant より大きくなる累積確率を返します。
sig.f14=14@Sig.F@SIG.F(?)@SIG.F(quant, df1, df2)。数値型。自由度 df1 および df2 を持つ F 分布から取り出された値が quant より大きくなる累積確率を返します。
sin1=1@Sin@SIN(?)@SIN(radians)。数値型。radians の正弦を返します。radians はラジアン単位の数値である必要があります。
sqrt1=1@Sqrt@SQRT(?)@SQRT(numexpr)。数値型。numexpr の正の平方根を返します。numexpr は数値である必要があり、負の数であってはなりません。
strapplymodel19=19@Strapplymodel@StrApplyModel(?,?,?)@StrApplyModel(handle, "function", value)。文字列。 handle で指定されたモデルを使用して、特定のスコア関数を入力ケースデータに適用します。"function" は、引用符で囲まれた文字列リテラル値で、次のうちのいずれかを指定します。 predict、stddev、probability、confidence、nodeid、cumhazard、neighbor、distance。モデル ハンドルは、MODEL HANDLE コマンドで定義した外部の XML ファイルに関連付けられた名前です。オプションの 3 番目の引数は、関数が「確率」、「近隣」、または「距離」の場合に適用されます。「確率」の場合、確率が計算されるカテゴリを指定します。「近隣」および「距離」の場合、最近隣モデルの特定の近隣を整数で指定します。StrApplyModel は、値を計算できない場合、空白文字列を返します。
string3=3@String@STRING(?,?)@STRING(numexpr,format)。文字列。format に従って numexpr を文字列に変換して返します。STRING(-1.5,F5.2) は、文字列値「-1.50」を返します。2 番目の引数 format は、数値型の値を書き出す書式である必要があります。
strunc16=16@Strunc@STRUNC(?,?)@STRUNC(strexp, length)。文字列。strexpr の長さ (バイト数) を切り捨てるために右側にあるスペースを削除します。切り捨ては、切り捨てられる文字のフラグメントを削除することです。
sum15=15@Sum@SUM(?,?)@SUM(numexpr,numexpr[,..])。数値型。有効な非欠損値を持つ引数の合計を返します。この関数には、2 つ以上の引数が必要です。この引数は、数値である必要があります。この関数が取る有効な引数の最小数を指定できます。
sysmis10=10@Sysmis@SYSMIS(?)@SYSMIS(numvar)。論理型。numvar の値がシステム欠損値である場合、1 または真を返します。引数 numvar は、アクティブなデータセット内にある数値型変数の名前である必要があります。
time.days17=17@Time.Days@TIME.DAYS(?)@TIME.DAYS(days)。数値型。指定した days に対応する時間の長さを返します。引数は数値型である必要があります。結果を時間で表示するには、結果変数に時間書式を割り当てます。
time.hms(1)17=17@Time.Hms(1)@TIME.HMS(?)@TIME.HMS(hours[,minutes,seconds])。数値型。指定した hours (時間)、min (分)、および sec (秒) に対応する時間間隔を返します。分と秒の引数は省略できます。分と秒は、それより前の引数が 0 以外の場合に 60 より少ない数に解決する必要があります。最後の 0 以外の引数を除くすべての引数は整数に解決する必要があります。たとえば、TIME.HMS(25.5) と TIME.HMS(0,90,25.5) は有効ですが、TIME.HMS(25.5,30) と TIME.HMS(25,90) は無効です。引数は、すべて正の値かすべて負の値のいずれかを指定する必要があります。結果を時間で表示するには、結果変数に時間書式を割り当てます。
time.hms(2)17=17@Time.Hms(2)@TIME.HMS(?,?)@TIME.HMS(hours[,minutes,seconds])。数値型。指定した hours (時間)、min (分)、および sec (秒) に対応する時間間隔を返します。分と秒の引数は省略できます。分と秒は、それより前の引数が 0 以外の場合に 60 より少ない数に解決する必要があります。最後の 0 以外の引数を除くすべての引数は整数に解決する必要があります。たとえば、TIME.HMS(25.5) と TIME.HMS(0,90,25.5) は有効ですが、TIME.HMS(25.5,30) と TIME.HMS(25,90) は無効です。引数は、すべて正の値かすべて負の値のいずれかを指定する必要があります。結果を時間で表示するには、結果変数に時間書式を割り当てます。
time.hms(3)17=17@Time.Hms(3)@TIME.HMS(?,?,?)@TIME.HMS(hours[,minutes,seconds])。数値型。指定した hours (時間)、min (分)、および sec (秒) に対応する時間間隔を返します。分と秒の引数は省略できます。分と秒は、それより前の引数が 0 以外の場合に 60 より少ない数に解決する必要があります。最後の 0 以外の引数を除くすべての引数は整数に解決する必要があります。たとえば、TIME.HMS(25.5) と TIME.HMS(0,90,25.5) は有効ですが、TIME.HMS(25.5,30) と TIME.HMS(25,90) は無効です。引数は、すべて正の値かすべて負の値のいずれかを指定する必要があります。結果を時間で表示するには、結果変数に時間書式を割り当てます。
trunc(1)1=1@Trunc(1)@TRUNC(?)@TRUNC(numexpr[,mult,fuzzbits])。数値型。numexpr を 0 に近づく方向に切り捨てた値を返します。省略可能な 2 番目の引数 mult は、結果がこの値の整数倍になることを指定します (TRUNC(4.579,0.1) = 4.5 など)。この値は数値である必要がありますが、0 にはできません。デフォルトは 1 です。省略可能な 3 番目の引数 fuzzbits は、numexpr が最も近い丸めの境界に満たない可能性があるが切り上げられる最小有意ビット数です。たとえば、numexpr が 1.4 ～ 1.5 で mult が 0.1 の場合、fuzzbits は numexpr が切り上げられるために 1.5 (最も近い境界) にどこまで近くできるかを示します。省略した場合、システム設定の FUZZBITS (インストール時に 6 に設定されます) が使用されます。
trunc(2)1=1@Trunc(2)@TRUNC(?,?)@TRUNC(numexpr[,mult,fuzzbits])。数値型。numexpr を 0 に近づく方向に切り捨てた値を返します。省略可能な 2 番目の引数 mult は、結果がこの値の整数倍になることを指定します (TRUNC(4.579,0.1) = 4.5 など)。この値は数値である必要がありますが、0 にはできません。デフォルトは 1 です。省略可能な 3 番目の引数 fuzzbits は、numexpr が最も近い丸めの境界に満たない可能性があるが切り上げられる最小有意ビット数です。たとえば、numexpr が 1.4 ～ 1.5 で mult が 0.1 の場合、fuzzbits は numexpr が切り上げられるために 1.5 (最も近い境界) にどこまで近くできるかを示します。省略した場合、システム設定の FUZZBITS (インストール時に 6 に設定されます) が使用されます。
trunc(3)1=1@Trunc(3)@TRUNC(?,?,?)@TRUNC(numexpr[,mult,fuzzbits])。数値型。numexpr を 0 に近づく方向に切り捨てた値を返します。省略可能な 2 番目の引数 mult は、結果がこの値の整数倍になることを指定します (TRUNC(4.579,0.1) = 4.5 など)。この値は数値である必要がありますが、0 にはできません。デフォルトは 1 です。省略可能な 3 番目の引数 fuzzbits は、numexpr が最も近い丸めの境界に満たない可能性があるが切り上げられる最小有意ビット数です。たとえば、numexpr が 1.4 ～ 1.5 で mult が 0.1 の場合、fuzzbits は numexpr が切り上げられるために 1.5 (最も近い境界) にどこまで近くできるかを示します。省略した場合、システム設定の FUZZBITS (インストール時に 6 に設定されます) が使用されます。
upcase16=16@Upcase@UPCASE(?)@UPCASE(strexpr)。文字列。小文字が大文字に変換され、他の文字は変換されずに返されます。
value10=10@Value@VALUE(?)@VALUE(variable)。数値型または文字型。variable のユーザー欠損値の定義を無視して variable の値を返します。variable は、変数の名前あるいは変数名へのベクトル参照である必要があります。
valuelabel9=9@Valuelabel@VALUELABEL(?)@VALUELABEL(varname)。文字列。変数値のための値ラベル、あるいは値ラベルがない場合は空の文字列を返します。varname の値は変数名である必要があります。式にすることはできません。
variance15=15@Variance@VARIANCE(?,?)@VARIANCE(numexpr,numexpr[,..])。数値型。有効な値を持つ引数の分数を返します。この関数には、2 つ以上の引数が必要です。この引数は、数値である必要があります。この関数が取る有効な引数の最小数を指定できます。
xdate.date7=7@Xdate.Date@XDATE.DATE(?)@XDATE.DATE(datevalue)。数値型。日付書式での数値から日付部分を返します。引数には、数値、日付書式変数、または日付の値を得ることができる式を指定できます。結果を日付で表示するには、結果変数に日付書式を適用します。
xdate.hour18=18@Xdate.Hour@XDATE.HOUR(?)@XDATE.HOUR(datetime)。数値型。時間または日時書式での数値から時間 (0 から 23 までの整数) を返します。引数には、数値、時間または日時変数、および時間または日時の値を得ることができる式を指定できます。
xdate.jday7=7@Xdate.Jday@XDATE.JDAY(?)@XDATE.JDAY(datevalue)。数値型。日付書式での数値から年単位の日 (1 から 366 までの整数) を返します。引数には、数値、日付書式変数、または日付の値を得ることができる式を指定できます。
xdate.mday7=7@Xdate.Mday@XDATE.MDAY(?)@XDATE.MDAY(datevalue)。数値型。日付書式での数値から月単位の日 (1 から 31 までの整数) を返します。引数には、数値、日付書式変数、または日付の値を得ることができる式を指定できます。
xdate.minute18=18@Xdate.Minute@XDATE.MINUTE(?)@XDATE.MINUTE(datetime)。数値型。時間または日時書式での数値から分 (0 から 59 までの整数) を返します。引数には、数値、時間または日時変数、および時間または日時の値を得ることができる式を指定できます。
xdate.month7=7@Xdate.Month@XDATE.MONTH(?)@XDATE.MONTH(datevalue)。数値型。日付書式での数値から月 (1 から 12 までの整数) を返します。引数には、数値、日付書式変数、または日付の値を得ることができる式を指定できます。
xdate.quarter7=7@Xdate.Quarter@XDATE.QUARTER(?)@XDATE.QUARTER(datevalue)。数値型。日付書式での数値から季 (1 から 4 までの整数) を返します。引数には、数値、日付書式変数、または日付の値を得ることができる式を指定できます。
xdate.second18=18@Xdate.Second@XDATE.SECOND(?)@XDATE.SECOND(datetime)。数値型。時間または日時書式での数値から秒 (0 から 60 までの整数) を返します。引数には、数値、時間または日時変数、および時間または日時の値を得ることができる式を指定できます。
xdate.tday7=7@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(timevalue)。数値型。時間間隔書式での数値から日数 (整数として) を返します。引数には、数値、時間書式変数、または時間間隔の値を得ることができる式を指定できます。
xdate.tday18=18@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(timevalue)。数値型。時間間隔書式での数値から日数 (整数として) を返します。引数には、数値、時間書式変数、または時間間隔の値を得ることができる式を指定できます。
xdate.time7=7@Xdate.Time@XDATE.TIME(?)@XDATE.TIME(datetime)。数値型。時間または日時書式の数値から秒数 (午前 0 時からの秒数) を返します。引数には、数値、時間または日時変数、および時間または日時の値を得ることができる式を指定できます。結果を時間で表示するには、結果変数に時間書式を適用します。
xdate.week7=7@Xdate.Week@XDATE.WEEK(?)@XDATE.WEEK(datevalue)。数値型。日付書式での数値から週番号 (1 から 53 までの整数) を返します。引数には、数値、日付書式変数、または日付の値を得ることができる式を指定できます。
xdate.wkday7=7@Xdate.Wkday@XDATE.WKDAY(?)@XDATE.WKDAY(datevalue)。数値型。日付書式での数値から曜日番号 (1 = 日曜から 7 = 土曜までの整数) を返します。引数には、数値、日付書式変数、または日付の値を得ることができる式を指定できます。
xdate.year7=7@Xdate.Year@XDATE.YEAR(?)@XDATE.YEAR(datevalue)。数値型。日付書式での数値から年 (4 桁の整数として) を返します。引数には、数値、日付書式変数、または日付の値を得ることができる式を指定できます。
yrmoda7=7@Yrmoda@YRMODA(?,?,?)@YRMODA(year,month,day)。数値型。1582 年 10 月 15 日から、year、month、および day の引数で表された日付までの日数を返します。これらの引数は、1582 年 10 月 15 日以降の有効な日付を形成する整数でなければなりません。年を表す 2 桁の値は、[オプション] の設定 ([編集] メニューの [オプション] にある [データ] タブ) に基づいた世紀の値になっているものとして扱われます。デフォルトでは、年を表す 2 桁は、現在の日付の 69 年前から 30 年後までの範囲として扱われます。
